app/controllers/api/v1/arrows_controller.rb

SELECT `arrows`.* FROM `arrows`
---
  def index
    @arrows = Arrow.all

INSERT INTO `arrows` (`content`, `created_at`, `updated_at`) VALUES ('asdasd', '2017-11-05 03:46:00', '2017-11-05 03:46:00')
---
  def create
    @arrow = Arrow.new(arrow_params)

    respond_to do |format|
      if @arrow.save

DELETE FROM `arrows` WHERE `arrows`.`id` = 27
---
  def destroy
    @arrow.destroy

SELECT  `arrows`.* FROM `arrows` WHERE `arrows`.`id` = 28 LIMIT 1
---
    def set_arrow
      @arrow = Arrow.find(params[:id])