app/controllers/api/v1/comments_controller.rb

SELECT `comments`.* FROM `comments`
---
  def index
    @comments = Comment.all

SELECT  `arrows`.* FROM `arrows` WHERE `arrows`.`id` = 1 LIMIT 1
---
    def set_arrow
      @comment_arrow = Arrow.find(params[:arrow_id])